I don't know terraform that well, but it looks to me like the same exact issue:

The output of `terraform show` which I copied to `main.tf` had no `source_details`, and when I added it manually I got the output: `oci_core_boot_volume.code_server_boot_volume must be replaced`, because `source_details { # forces replacement`.

Full logs here:
```bash
jakubkoralewski@Er codeserver-2-tf-gh-repro % terraform import oci_core_boot_volume.code_server_boot_volume ocid1.bootvolume.oc1.eu-amsterdam-1.id
oci_core_boot_volume.code_server_boot_volume: Importing from ID "ocid1.bootvolume.oc1.eu-amsterdam-1.id"...
oci_core_boot_volume.code_server_boot_volume: Import prepared!
  Prepared oci_core_boot_volume for import
oci_core_boot_volume.code_server_boot_volume: Refreshing state... [id=ocid1.bootvolume.oc1.eu-amsterdam-1.id]

Import successful!

The resources that were imported are shown above. These resources are now in
your Terraform state and will henceforth be managed by Terraform.
jakubkoralewski@Er codeserver-2-tf-gh-repro % terraform plan
oci_core_boot_volume.code_server_boot_volume: Refreshing state... [id=ocid1.bootvolume.oc1.eu-amsterdam-1.id]

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # oci_core_boot_volume.code_server_boot_volume must be replaced
-/+ resource "oci_core_boot_volume" "code_server_boot_volume" {
      ~ auto_tuned_vpus_per_gb     = "10" -> (known after apply)
      + backup_policy_id           = (known after apply)
      + cluster_placement_group_id = (known after apply)
      ~ freeform_tags              = {} -> (known after apply)
      ~ id                         = "ocid1.bootvolume.oc1.eu-amsterdam-1.id" -> (known after apply)
      ~ image_id                   = "ocid1.image.oc1.eu-amsterdam-1.id" -> (known after apply)
      ~ is_auto_tune_enabled       = true -> (known after apply)
      ~ is_hydrated                = true -> (known after apply)
      + kms_key_id                 = (known after apply)
      ~ size_in_mbs                = "51200" -> (known after apply)
      ~ state                      = "AVAILABLE" -> (known after apply)
      ~ system_tags                = {
          - "orcl-cloud.free-tier-retained" = "true"
        } -> (known after apply)
      ~ time_created               = "2021-12-14 18:45:30.188 +0000 UTC" -> (known after apply)
      + volume_group_id            = (known after apply)
      + xrc_kms_key_id             = (known after apply)
        # (6 unchanged attributes hidden)

      ~ autotune_policies {
          + max_vpus_per_gb = (known after apply)
            # (1 unchanged attribute hidden)
        }

      ~ boot_volume_replicas (known after apply)

      + source_details { # forces replacement
          + type = "bootVolume" # forces replacement
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.

──────────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

main.tf
```tf
resource "oci_core_boot_volume" "code_server_boot_volume" {
  availability_domain = "fkYL:eu-amsterdam-1-AD-1"
  compartment_id      = "ocid1.tenancy.oc1..id"
  defined_tags = {
    "Oracle-Tags.CreatedBy" = "oracleidentitycloudservice/my-email@gmail.com"
    "Oracle-Tags.CreatedOn" = "2021-12-14T18:45:26.894Z"
  }
  display_name  = "code-server (Boot Volume)"
  freeform_tags = {}
  size_in_gbs   = "50"
  vpus_per_gb   = "10"
  source_details {
    type = "bootVolume"
  }

  autotune_policies {
    autotune_type   = "DETACHED_VOLUME"
    max_vpus_per_gb = null
  }
}
```